Revit 2023 API
IndependentTag.LeadersPresentationMode Property
 Identifies the Presentation Mode that is applied to tag leaders.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
Since: 2023
Syntax
C#
public LeadersPresentationMode LeadersPresentationMode { get; set; }
Visual Basic
Public Property LeadersPresentationMode As LeadersPresentationMode
	Get
	Set
Visual C++
public:
property LeadersPresentationMode LeadersPresentationMode {
	LeadersPresentationMode get ();
	void set (LeadersPresentationMode value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  When setting this property: The LeadersPresentationMode LeadersPresentationMode.ShowOnlyOne or LeadersPresentationMode.ShowSpecificLeaders can't be set to a tag with only one leader.
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Autodesk.Revit.Exceptions.InvalidOperationException |  When setting this property: For this tag leaders are not allowed.
See Also
IndependentTag Class
Autodesk.Revit.DB Namespace